[EclecticIQ alert]
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.severity = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 5 * * * *
description = EclecticIQ Threat Intelligence alert based on the plain search.
disabled = 1
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
display.events.fields = ["host","source","sourcetype","dest_eiq","eiq_dest","eiq_url","eiq_src","eiq_domain","eiq_file_hash","eiq_receiver","eiq_sender","url","id_eiq_dest","id_eiq_domain","id_eiq_file_hash","id_eiq_receiver","id_eiq_sender","id_eiq_src","id_eiq_url","value_url_eiq","value_eiq_dest","value_eiq_domain","value_eiq_file_hash","value_eiq_receiver","value_eiq_sender","value_eiq_src","value_eiq_url","v2","alert_field","type_eiq","alert_source"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SA-EclecticIQ
request.ui_dispatch_view = search
search = `eiq_sightings_search` (dest_ip=* OR dest=* OR dst=* OR query=* OR url=* OR file_hash=* OR md5=* OR sha1=* OR sha256=* OR sha512=* OR sender=* OR src_user=* OR src_ip=* OR src=* OR hostname=* OR recipient=* OR receiver=* OR dest_user=* OR domain=*)\
| rex field=url "(http(?s)\:\/\/)(?<eiq_domain>[\w\-\.]+)(\:|\/|$)"\
| eval eiq_dest=coalesce(dest_ip, dest, dst)\
| eval eiq_src=coalesce(src_ip, src)\
| eval eiq_domain=coalesce(domain, query, eiq_domain, hostname)\
| eval eiq_url=coalesce(url, query)\
| eval eiq_file_hash=coalesce(file_hash, md5, sha1, sha256, sha512)\
| eval eiq_sender=coalesce(sender, src_user)\
| eval eiq_receiver=coalesce(recipient, receiver, dest_user)\
| lookup eiq_ioc_list value_eiq as eiq_src OUTPUTNEW value_eiq AS value_eiq_src value_url_eiq type_eiq timestamp_eiq source.name_eiq meta.tags_eiq meta.taxonomy_eiq meta.relevancy_eiq feed_id_eiq entity.id_eiq entity.title_eiq value_eiq meta.entity_url_eiq\
| lookup eiq_ioc_list value_eiq as eiq_dest OUTPUTNEW value_eiq AS value_eiq_dest value_url_eiq type_eiq timestamp_eiq source.name_eiq meta.tags_eiq meta.taxonomy_eiq meta.relevancy_eiq feed_id_eiq entity.id_eiq entity.title_eiq value_eiq meta.entity_url_eiq\
| lookup eiq_ioc_list value_eiq as eiq_file_hash OUTPUTNEW value_eiq AS value_eiq_file_hash value_url_eiq type_eiq timestamp_eiq source.name_eiq meta.tags_eiq meta.taxonomy_eiq meta.relevancy_eiq feed_id_eiq entity.id_eiq entity.title_eiq value_eiq meta.entity_url_eiq\
| lookup eiq_ioc_list value_eiq as eiq_domain OUTPUTNEW value_eiq AS value_eiq_domain value_url_eiq type_eiq timestamp_eiq source.name_eiq meta.tags_eiq meta.taxonomy_eiq meta.relevancy_eiq feed_id_eiq entity.id_eiq entity.title_eiq value_eiq meta.entity_url_eiq\
| lookup eiq_ioc_list value_eiq as eiq_url OUTPUTNEW value_eiq AS value_eiq_url value_url_eiq type_eiq timestamp_eiq source.name_eiq meta.tags_eiq meta.taxonomy_eiq meta.relevancy_eiq feed_id_eiq entity.id_eiq entity.title_eiq value_eiq meta.entity_url_eiq\
| lookup eiq_ioc_list value_eiq as eiq_sender  OUTPUTNEW value_eiq AS value_eiq_sender value_url_eiq type_eiq timestamp_eiq source.name_eiq meta.tags_eiq meta.taxonomy_eiq meta.relevancy_eiq feed_id_eiq entity.id_eiq entity.title_eiq value_eiq meta.entity_url_eiq\
| lookup eiq_ioc_list value_eiq as eiq_receiver OUTPUTNEW value_eiq AS value_eiq_receiver value_url_eiq type_eiq timestamp_eiq source.name_eiq meta.tags_eiq meta.taxonomy_eiq meta.relevancy_eiq feed_id_eiq entity.id_eiq entity.title_eiq value_eiq meta.entity_url_eiq\
| search (value_eiq_src=* OR value_eiq_dest=* OR value_eiq_file_hash=* OR value_eiq_domain=* OR value_eiq_url=* OR value_eiq_sender=* OR value_eiq_receiver=*) value_eiq=*\
| eval alert_field=case(isnotnull(value_eiq_src), "src", isnotnull(value_eiq_dest), "dest", isnotnull(value_eiq_file_hash), "file_hash", isnotnull(value_eiq_domain), "domain", isnotnull(value_eiq_url), "url", isnotnull(value_eiq_sender), "sender", isnotnull(value_eiq_receiver), "receiver")\
| eval event_hash=md5(_raw)\
| eval alert_source="splunk_search"\
| eval key=_time."-".'event_hash', event_index=index, event_sourcetype=sourcetype, event_time=_time, event_host=host, event_time_1=(_time+1)\
| table key, alert_field, alert_source, eiq_src, eiq_dest, event_time, event_hash, event_index, event_host, event_sourcetype, value_url_eiq, type_eiq, timestamp_eiq, source.name_eiq, meta.tags_eiq, meta.relevancy_eiq, feed_id_eiq, entity.id_eiq, entity.title_eiq, value_eiq, meta.entity_url_eiq, meta.taxonomy_eiq, event_time_1\
| rename source.name_eiq AS source_name_eiq, meta.tags_eiq AS meta_tags_eiq, meta.relevancy_eiq AS meta_relevancy_eiq, entity.id_eiq AS entity_id_eiq, entity.title_eiq AS entity_title_eiq, meta.entity_url_eiq AS meta_entity_url_eiq, meta.taxonomy_eiq AS meta_taxonomy_eiq, eiq_src AS src, eiq_dest AS dest | eval sighting="0"\
| outputlookup eiq_alerts_list append=True key_field=key

[EclecticIQ tstats Threat Intelligence alert - Email]
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.severity = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 5 * * * *
description = EclecticIQ Threat Intelligence alert based on Data Models accelerated data
disabled = 1
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
display.events.fields = ["host","source","sourcetype","dest_eiq","eiq_dest","eiq_url","eiq_src","eiq_domain","eiq_file_hash","eiq_receiver","eiq_sender","url","id_eiq_dest","id_eiq_domain","id_eiq_file_hash","id_eiq_receiver","id_eiq_sender","id_eiq_src","id_eiq_url","value_url_eiq","value_eiq_dest","value_eiq_domain","value_eiq_file_hash","value_eiq_receiver","value_eiq_sender","value_eiq_src","value_eiq_url","v2","alert_field","type_eiq","alert_source"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SA-EclecticIQ
request.ui_dispatch_view = search
search = | `eiq_dm_alert_email`\
| eval alert_field=case(isnotnull(value_eiq_sender), "sender", isnotnull(value_eiq_receiver), "receiver")\
| eval event_hash=md5(sourcetype.index._time.host.value_eiq)\
| eval alert_source="splunk_dm_search"\
| eval key=_time."-".'event_hash', event_index=index, event_sourcetype=sourcetype, event_time=_time, event_host=host, event_time_1=(_time+1)\
| dedup key\
| table key, alert_field, alert_source, eiq_src, eiq_dest, event_time, event_hash, event_index, event_host, event_sourcetype, value_url_eiq, type_eiq, timestamp_eiq, source.name_eiq, meta.tags_eiq, meta.relevancy_eiq, feed_id_eiq, entity.id_eiq, entity.title_eiq, value_eiq, meta.entity_url_eiq, meta.taxonomy_eiq, event_time_1\
| rename source.name_eiq AS source_name_eiq, meta.tags_eiq AS meta_tags_eiq, meta.relevancy_eiq AS meta_relevancy_eiq, entity.id_eiq AS entity_id_eiq, entity.title_eiq AS entity_title_eiq, meta.entity_url_eiq AS meta_entity_url_eiq, meta.taxonomy_eiq AS meta_taxonomy_eiq, eiq_src AS src, eiq_dest AS dest | eval sighting="0"\
| outputlookup eiq_alerts_list append=True key_field=key


[EclecticIQ tstats Threat Intelligence alert - Hash]
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.severity = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 5 * * * *
description = EclecticIQ Threat Intelligence alert based on Data Models accelerated data
disabled = 1
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
display.events.fields = ["host","source","sourcetype","dest_eiq","eiq_dest","eiq_url","eiq_src","eiq_domain","eiq_file_hash","eiq_receiver","eiq_sender","url","id_eiq_dest","id_eiq_domain","id_eiq_file_hash","id_eiq_receiver","id_eiq_sender","id_eiq_src","id_eiq_url","value_url_eiq","value_eiq_dest","value_eiq_domain","value_eiq_file_hash","value_eiq_receiver","value_eiq_sender","value_eiq_src","value_eiq_url","v2","alert_field","type_eiq","alert_source"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SA-EclecticIQ
request.ui_dispatch_view = search
search = | `eiq_dm_alert_hash`\
| eval alert_field=case(isnotnull(value_eiq_file_hash), "file_hash")\
| eval event_hash=md5(sourcetype.index._time.host.value_eiq)\
| eval alert_source="splunk_dm_search"\
| eval key=_time."-".'event_hash', event_index=index, event_sourcetype=sourcetype, event_time=_time, event_host=host, event_time_1=(_time+1)\
| dedup key\
| table key, alert_field, alert_source, eiq_src, eiq_dest, event_time, event_hash, event_index, event_host, event_sourcetype, value_url_eiq, type_eiq, timestamp_eiq, source.name_eiq, meta.tags_eiq, meta.relevancy_eiq, feed_id_eiq, entity.id_eiq, entity.title_eiq, value_eiq, meta.entity_url_eiq, meta.taxonomy_eiq, event_time_1\
| rename source.name_eiq AS source_name_eiq, meta.tags_eiq AS meta_tags_eiq, meta.relevancy_eiq AS meta_relevancy_eiq, entity.id_eiq AS entity_id_eiq, entity.title_eiq AS entity_title_eiq, meta.entity_url_eiq AS meta_entity_url_eiq, meta.taxonomy_eiq AS meta_taxonomy_eiq, eiq_src AS src, eiq_dest AS dest | eval sighting="0"\
| outputlookup eiq_alerts_list append=True key_field=key

[EclecticIQ tstats Threat Intelligence alert - Domain]
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.severity = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 5 * * * *
description = EclecticIQ Threat Intelligence alert based on Data Models accelerated data
disabled = 1
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
display.events.fields = ["host","source","sourcetype","dest_eiq","eiq_dest","eiq_url","eiq_src","eiq_domain","eiq_file_hash","eiq_receiver","eiq_sender","url","id_eiq_dest","id_eiq_domain","id_eiq_file_hash","id_eiq_receiver","id_eiq_sender","id_eiq_src","id_eiq_url","value_url_eiq","value_eiq_dest","value_eiq_domain","value_eiq_file_hash","value_eiq_receiver","value_eiq_sender","value_eiq_src","value_eiq_url","v2","alert_field","type_eiq","alert_source"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SA-EclecticIQ
request.ui_dispatch_view = search
search = | `eiq_dm_alert_domain`\
| eval alert_field=case(isnotnull(value_eiq_domain), "domain")\
| eval event_hash=md5(sourcetype.index._time.host.value_eiq)\
| eval alert_source="splunk_dm_search"\
| eval key=_time."-".'event_hash', event_index=index, event_sourcetype=sourcetype, event_time=_time, event_host=host, event_time_1=(_time+1)\
| dedup key\
| table key, alert_field, alert_source, eiq_src, eiq_dest, event_time, event_hash, event_index, event_host, event_sourcetype, value_url_eiq, type_eiq, timestamp_eiq, source.name_eiq, meta.tags_eiq, meta.relevancy_eiq, feed_id_eiq, entity.id_eiq, entity.title_eiq, value_eiq, meta.entity_url_eiq, meta.taxonomy_eiq, event_time_1\
| rename source.name_eiq AS source_name_eiq, meta.tags_eiq AS meta_tags_eiq, meta.relevancy_eiq AS meta_relevancy_eiq, entity.id_eiq AS entity_id_eiq, entity.title_eiq AS entity_title_eiq, meta.entity_url_eiq AS meta_entity_url_eiq, meta.taxonomy_eiq AS meta_taxonomy_eiq, eiq_src AS src, eiq_dest AS dest | eval sighting="0"\
| outputlookup eiq_alerts_list append=True key_field=key

[EclecticIQ tstats Threat Intelligence alert - URL]
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.severity = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 5 * * * *
description = EclecticIQ Threat Intelligence alert based on Data Models accelerated data
disabled = 1
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
display.events.fields = ["host","source","sourcetype","dest_eiq","eiq_dest","eiq_url","eiq_src","eiq_domain","eiq_file_hash","eiq_receiver","eiq_sender","url","id_eiq_dest","id_eiq_domain","id_eiq_file_hash","id_eiq_receiver","id_eiq_sender","id_eiq_src","id_eiq_url","value_url_eiq","value_eiq_dest","value_eiq_domain","value_eiq_file_hash","value_eiq_receiver","value_eiq_sender","value_eiq_src","value_eiq_url","v2","alert_field","type_eiq","alert_source"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SA-EclecticIQ
request.ui_dispatch_view = search
search = | `eiq_dm_alert_url`\
| eval alert_field=case(isnotnull(value_eiq_url), "url")\
| eval event_hash=md5(sourcetype.index._time.host.value_eiq)\
| eval alert_source="splunk_dm_search"\
| eval key=_time."-".'event_hash', event_index=index, event_sourcetype=sourcetype, event_time=_time, event_host=host, event_time_1=(_time+1)\
| dedup key\
| table key, alert_field, alert_source, eiq_src, eiq_dest, event_time, event_hash, event_index, event_host, event_sourcetype, value_url_eiq, type_eiq, timestamp_eiq, source.name_eiq, meta.tags_eiq, meta.relevancy_eiq, feed_id_eiq, entity.id_eiq, entity.title_eiq, value_eiq, meta.entity_url_eiq, meta.taxonomy_eiq, event_time_1\
| rename source.name_eiq AS source_name_eiq, meta.tags_eiq AS meta_tags_eiq, meta.relevancy_eiq AS meta_relevancy_eiq, entity.id_eiq AS entity_id_eiq, entity.title_eiq AS entity_title_eiq, meta.entity_url_eiq AS meta_entity_url_eiq, meta.taxonomy_eiq AS meta_taxonomy_eiq, eiq_src AS src, eiq_dest AS dest | eval sighting="0"\
| outputlookup eiq_alerts_list append=True key_field=key

[EclecticIQ tstats Threat Intelligence alert - Source/Destination]
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.severity = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 5 * * * *
description = EclecticIQ Threat Intelligence alert based on Data Models accelerated data
disabled = 1
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
display.events.fields = ["host","source","sourcetype","dest_eiq","eiq_dest","eiq_url","eiq_src","eiq_domain","eiq_file_hash","eiq_receiver","eiq_sender","url","id_eiq_dest","id_eiq_domain","id_eiq_file_hash","id_eiq_receiver","id_eiq_sender","id_eiq_src","id_eiq_url","value_url_eiq","value_eiq_dest","value_eiq_domain","value_eiq_file_hash","value_eiq_receiver","value_eiq_sender","value_eiq_src","value_eiq_url","v2","alert_field","type_eiq","alert_source"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SA-EclecticIQ
request.ui_dispatch_view = search
search = | `eiq_dm_alert_src_dst`\
| eval alert_field=case(isnotnull(value_eiq_src), "src", isnotnull(value_eiq_dest), "dest")\
| eval event_hash=md5(sourcetype.index._time.host.value_eiq)\
| eval alert_source="splunk_dm_search"\
| eval key=_time."-".'event_hash', event_index=index, event_sourcetype=sourcetype, event_time=_time, event_host=host, event_time_1=(_time+1)\
| dedup key\
| table key, alert_field, alert_source, eiq_src, eiq_dest, event_time, event_hash, event_index, event_host, event_sourcetype, value_url_eiq, type_eiq, timestamp_eiq, source.name_eiq, meta.tags_eiq, meta.relevancy_eiq, feed_id_eiq, entity.id_eiq, entity.title_eiq, value_eiq, meta.entity_url_eiq, meta.taxonomy_eiq, event_time_1\
| rename source.name_eiq AS source_name_eiq, meta.tags_eiq AS meta_tags_eiq, meta.relevancy_eiq AS meta_relevancy_eiq, entity.id_eiq AS entity_id_eiq, entity.title_eiq AS entity_title_eiq, meta.entity_url_eiq AS meta_entity_url_eiq, meta.taxonomy_eiq AS meta_taxonomy_eiq, eiq_src AS src, eiq_dest AS dest | eval sighting="0"\
| outputlookup eiq_alerts_list append=True key_field=key